20240224T021232--kdoc-102-応答不可な時間帯を作って集中する__essay.org
:properties:
:ID: 20240224T021232
:mtime:    20241102192612 20241102180254 20241028101410
:ctime:    20241028101410
:end:
#+title:      KDOC 102: 応答不可な時間帯を作って集中する
#+date:       [2024-02-24 Sat 02:12]
#+filetags:   :essay:
#+identifier: 20240224T021232

* この文書のステータス
- 作成
  - [X] 2024-02-24 貴島
- レビュー
  - [X] 2024-02-25 貴島

* 概要
『[[https://amzn.to/3SE79Xi][世界一流エンジニアの思考法]]』のメインテーマの1つは、いかにやらないか、本当にやるべきことへ集中するかということだった。一切連絡に応答しない集中の時間帯を作っている、という話がよさそうに思えたので2週間やってみた。
* やった感想
今までは常時応答が社会人としてある **べき** と考えていたので、Slackには即レスするようにしていた。サボっているように見られないかを心配していた。なので実行にあたって、事前に同僚へ伝えておいても、見ないのには少し不安があった。しかし、困ることはなかった。集中できていた。

Slackは依存症のようなもので、最初は意図しないと断つのは難しい。断つコツは、Slackを閉じ、インターネットを遮断することだ。通知がこないようにするのと、簡単に見られないようにする。通知が来なくても見て回るのが癖になっていた。

最初の3日は違和感、不安があったが、それもすぐなくなった。没頭して仕事がよく進んでいると確信できる。応答待ちなだけでもリソースを食う。無自覚にコストを支払い続けてきた。いらないことに対して感度を上げていこうと考えた。

* 関連
- [[id:20240212T234008][KDOC 91: 『世界一流エンジニアの思考法』]]。で書いてあったことをやってみた感想
