20240224T021232--kdoc-102-応答不可な時間帯を作って集中する__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 102: 応答不可な時間帯を作って集中する</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 102: 応答不可な時間帯を作って集中する</h1>

<div id="outline-container-org5fbb3d8" class="outline-2">
<h2 id="org5fbb3d8"><a href="#org5fbb3d8">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org5fbb3d8">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-24 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-25 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge7afa28" class="outline-2">
<h2 id="orge7afa28"><a href="#orge7afa28">概要</a></h2>
<div class="outline-text-2" id="text-orge7afa28">
<p>
『<a href="https://amzn.to/3SE79Xi">世界一流エンジニアの思考法</a>』のメインテーマの1つは、いかにやらないか、本当にやるべきことへ集中するかということだった。一切連絡に応答しない集中の時間帯を作っている、という話がよさそうに思えたので2週間やってみた。
</p>
</div>
</div>
<div id="outline-container-orge3c3a5a" class="outline-2">
<h2 id="orge3c3a5a"><a href="#orge3c3a5a">やった感想</a></h2>
<div class="outline-text-2" id="text-orge3c3a5a">
<p>
今までは常時応答が社会人としてある <b><b>べき</b></b> と考えていたので、Slackには即レスするようにしていた。サボっているように見られないかを心配していた。なので実行にあたって、事前に同僚へ伝えておいても、見ないのには少し不安があった。しかし、困ることはなかった。集中できていた。
</p>

<p>
Slackは依存症のようなもので、最初は意図しないと断つのは難しい。断つコツは、Slackを閉じ、インターネットを遮断することだ。通知がこないようにするのと、簡単に見られないようにする。通知が来なくても見て回るのが癖になっていた。
</p>

<p>
最初の3日は違和感、不安があったが、それもすぐなくなった。没頭して仕事がよく進んでいると確信できる。応答待ちなだけでもリソースを食う。無自覚にコストを支払い続けてきた。いらないことに対して感度を上げていこうと考えた。
</p>
</div>
</div>

<div id="outline-container-org1feb942" class="outline-2">
<h2 id="org1feb942"><a href="#org1feb942">関連</a></h2>
<div class="outline-text-2" id="text-org1feb942">
<ul class="org-ul">
<li><a href="20240212T234008--kdoc-91-『世界一流エンジニアの思考法』__book.html#ID-20240212T234008">KDOC 91: 『世界一流エンジニアの思考法』</a>。で書いてあったことをやってみた感想</li>
</ul>
</div>
</div>


<div id="outline-container-orgf21687a" class="outline-2">
<h2 id="orgf21687a"><a href="#orgf21687a">Backlinks</a></h2>
<div class="outline-text-2" id="text-orgf21687a">
<ul class="org-ul">
<li><a href="./20240224T025714--kdoc-103-ゆるいインターネット断ちのやり方__essay.html">KDOC 103: ゆるいインターネット断ちのやり方</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
